test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Parallel_SequenceBased/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
2.03451e-10
2.03451e-10
2.03451e-10
2.03451e-10
2.03451e-10
2.03451e-10
2.03451e-10
2.03451e-10
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
1.95313e-07
1.95313e-07
1.95312e-07
1.95313e-07
1.95313e-07
1.95312e-07
1.95313e-07
1.95313e-07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
1.95313e-07
1.95313e-07
1.95312e-07
1.95313e-07
1.95313e-07
1.95312e-07
1.95313e-07
1.95313e-07
...
)
;
    }
    mantle
    {
        type            calculated;
        value           nonuniform List<scalar> 
1536
(
1.02101e-06
1.02101e-06
1.02101e-06
1.02101e-06
1.02101e-06
1.02101e-06
1.02101e-06
1.02101e-06
...
)
;
    }
}


// ************************************************************************* //
