test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Parallel_SequenceBased/0/ccx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
0.0244792
0.0234375
0.0223958
0.0213542
0.0203125
0.0192708
0.0182292
0.0171875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.025
-0.025
-0.025
-0.025
-0.025
-0.025
-0.025
-0.025
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.025
0.025
0.025
0.025
0.025
0.025
0.025
0.025
...
)
;
    }
    mantle
    {
        type            calculated;
        value           nonuniform List<scalar> 
1536
(
-0.0244792
-0.0244792
-0.0244792
-0.0244792
-0.0244792
-0.0244792
-0.0244792
-0.0244792
...
)
;
    }
}


// ************************************************************************* //
