test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Parallel_SequenceBased/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	 ".*"
	 {
		 type            fixedValue;
	 	 value           uniform (0 0 0);
	 }


mantle
{
type fixedValue;
value  nonuniform List<vector>
1568
(
(0.0 -0.0 0.0)
(0.0 -6.526309631767351e-05 0.0)
(0.0 -6.400908422185608e-05 1.2732198476667924e-05)
(0.0 -0.0 0.0)
(0.0 -6.029523891625365e-05 2.4975105705518476e-05)
(0.0 -0.0 0.0)
(0.0 -5.426428139547376e-05 3.625823362496816e-05)
(0.0 -0.0 0.0)
...
);
}
